content/posts/hello-world.md
+++
title = "Hello World"
date = 2023-05-18
draft = false
+++

Just for the heck of it I have started adding some content to these pages, mainly as a reference for myself as I have a tendency to forget stuff a lot quicker than time taken to learn it, unless I keep notes like this.

<!--more-->

I will be writing the posts in [Emacs](https://www.gnu.org/software/emacs/) [org mode](https://orgmode.org/) and exporting them via [ox-hugo](https://ox-hugo.scripter.co/) to Hugo compatible markdown files in order that I can use the excellent [Hugo](https://gohugo.io/) as the static site generator.

I tested other SSG's, mainly [Jekyll](https://jekyllrb.com/), but Hugo suited me better as its easier to setup and configure and allows me to write notes in org-mode and easily export them to compatible markdown - automatically even, if desired.

Initially I'm intending to post content about my experience with using [Fedora Silverblue](https://silverblue.fedoraproject.org/) as my linux distro of choice and what is required to have a solid working local development environment.

Hugo also integrates well with [GitHub pages](https://docs.github.com/en/pages/getting-started-with-github-pages/about-github-pages#types-of-github-pages-sites) which i will use to host the generated site.
